{
    "text": "Code 212 : le premier centre ouvrira à Agadir\nLe premier centre Code 212 ouvrira ses portes dès le mois d’octobre à l’Université Ibn Zohr d’Agadir.\n\nC’est ce qu’Abdellatif Miraoui, ministre de l’Enseignement supérieur, de la recherche scientifique et de l’innovation, nous a confié.\n\nSuivra l’Université Ibn Tofail de Kénitra qui abritera aussi un centre Code 212.\n\nPour rappel, il est prévu d’ouvrir 7 centres Code 212 à l’échelle nationale. Le ministère prévoit de construire plusieurs écoles de coding, baptisées «Code 212», auxquelles les étudiants auront un accès libre. Elles adopteront une pédagogie d’apprentissage peer-to-peer (ou pair-à-pair, un système de communication entre plusieurs ordinateurs reliés à une connexion Internet, sans nécessité de passer par un serveur central). Le ministère de l’Enseignement supérieur prévoit de recruter près de 2.350 personnes cette année, dont 1.300 postes pour l’encadrement administratif et pédagogique, conformément au projet de loi de Finances 2023. Parmi ces postes budgétaires, 750 seront destinés à la formation dans les sciences de l’éducation et la médecine.\n\nÀ quoi sert le « Code 212 » ? Les explications de Miraoui\nLe ministère de l’Enseignement supérieur, de la Recherche scientifique et de l’Innovation, amorce dès cette année une réforme profonde de l’écosystème de la recherche scientifique et de l’innovation. L’objectif est d’être au diapason de la croissance du pays. L’université devient incontournable et joue donc un rôle central. \n\n«Nous vivons une période dynamique, caractérisée par des avancées significatives dans des domaines tels que l’intelligence artificielle, l’hydrogène, le dessalement de l’eau de mer et les énergies renouvelables», relève Abdellatif Miraoui qui était l’Invité des Éco. Dans ce contexte, le renouvellement de l’université devient crucial, car la recherche scientifique joue un rôle central dans le progrès du pays. Pour ce qui est de la promotion de la recherche scientifique et de l’innovation et leur alignement sur les priorités de développement de notre pays, des actions concrètes seront déployées dès cette année, ajoute le ministre.\n\nLe ministre rappelle également l’importance centrale du numérique, qui est l’un des paris d’avenir du Maroc, tout comme l’énergie verte. L’objectif est de faire passer la part du secteur numérique à 5% du PIB d’ici 2035 contre environ 1% actuellement. Face aux enjeux actuels et futurs liés à l’émergence des technologies numériques, le PACTE ESRI-2030 accorde une priorité à la formation dans les métiers du digital. Cela se concrétise par le biais de filières spécifiques et de formations certifiantes dispensées dans le cadre des centres Code 212.\n\n"
}
